app/helpers/helpers.php

function getVal($key = "")
{
    $data = Config::select('value')->where('name', 'LIKE', $key)->first();
---
select `value` from `config` where `name` LIKE 'background' limit 1