app/helpers/helpers.php

select * from `insurance` where `id` = '9' limit 1
---
function price_product($product,  $ops = "", $options = ['qty' => 1])
{
    $qty = (int) $options['qty'];
    $price = (int) ($product->price - $product->discount);
    $arrIns = explode(",", $ops);

    if (count($arrIns) > 0) {
        foreach ($arrIns as  $ins_id) {
            $item = Insurance::where('id', $ins_id)->first();

select `value` from `config` where `name` LIKE 'switchboard' limit 1
---
function getVal($key = "")
{
    $data = Config::select('value')->where('name', 'LIKE', $key)->first();