app/Http/Controllers/AdminProductController.php

    public function product_view_add(Request $request)
    {
        $category = Category::where('parent_id', '=', 0)->get();
        $ins = Insurance::all();
        $policy = Policy::all();
        $producer = Producer::all();
        $cat_game = CatGame::all();
---
select * from `category` where `parent_id` = 0
select * from `insurance`
select * from `policy`
select * from `producer`
select * from `cat_game`

    public function product_view_edit($id, Request $request)
    {
        $array_products = array();
        $array_blogs = array();
        $product = Products::where('id', '=', $id)->firstOrFail();
        if (Gate::allows('group-4')) {
        } else {
            $this->authorize('edit-product', $product);
        }
        $product_policies = array();
        $product_ins = array();
        $link_policies = Products::find($id)->policies;
        $link_ins = Products::find($id)->ins;
        foreach ($link_policies as $lp) {
            array_push($product_policies, $lp->plc_id);
        }
        foreach ($link_ins as $li) {
            array_push($product_ins, $li->ins_id);
        }
        $category = Category::where('parent_id', '=', 0)->get();
        $ins = Insurance::all();
        $policy = Policy::all();
        $producer = Producer::all();
        $cat_game = CatGame::all();
---
select * from `producer`
select * from `cat_game`