app/Http/Controllers/ClientProductsController.php

    public function index($slug, Request $request, ModelInterface $vam)
    {
        if (!$request->has('isAjax')) {
            $bc =  explode("/", Str::replaceFirst('/', '', Str::replace(url('category/'), '', url()->current())));
            $slug = collect($bc)->last();
        }
        $category =  Category::where('slug', 'LIKE', $slug)->firstOrFail();
        $view = $request->cookie('view');
        $page = $request->has('page') ? $request->page : 1;
        $list_banner = gllCat::where('cate_id', '=', $category->id)->get();
        $id = $category->id;
        // FIX CÁC RELATIONSHIP MANY-MANY
        $products = Products::with(['categories' => function ($q) use ($category) {
            $q->where('slug', 'LIKE', $category->slug);
        }])->whereHas(
            'categories',
            function ($q) use ($category) {
                $q->where('slug', 'LIKE', $category->slug);
            }

        );
---
select * from `category` where `slug` LIKE 'ps5' limit 1
select * from `gll_category` where `cate_id` = 77