app/Http/Controllers/HomeController.php

select * from `category` where `category`.`id` in (79, 81, 82, 113, 115, 116, 124, 126)
select * from `config`
select * from `banners` where `index` != 0
select * from `fix_menu`
select * from `banners` where `index` = 0 limit 1
select * from `slides` where `status` = 1 order by `index` asc
select * from `blogs` where `active` = 1 order by `id` desc limit 8
---
    public function index(Request $request)
    {

        $show_home = showHome::where('active', '=', 1)->with(['sections', 'sections.category'])->orderBy('position', 'asc')->get();
        $company = Config::all();
        $banners = Banners::where('index', '!=', 0)->get();
        $menu_fix = FixMenu::all();
        $banner = Banners::where('index', '=', 0)->first();
        $slides = Slides::where('status', '=', 1)->orderBy('index', 'ASC')->get();
        $blogs = Blogs::with(['author', 'category'])->where('active', '=', 1)->orderBy('id', 'DESC')->limit(8)->get();