app/Models/Category.php

select * from `category` where `id` not in (145, 141)
---
    public static function tree()
    {
        $array_except = array(145, 141);
        $allCategories = Category::whereNotIn('id', $array_except)->get();

select * from `category` where `id` != 145
select * from `category` where `id` = 120
---
    static function OneCatTree($id)
    {
        $allCategories = Category::where('id', '!=', 145)->get();
        $category = Category::where('id', '=', $id)->get();

select * from `category` where `id` != 145
select * from `category` where `id` = 77
---
    static function ParentTree($id)
    {
        $allCategories = Category::where('id', '!=', 145)->get();
        $category = Category::where('id', '=', $id)->get();