app/Repositories/AdminPrdRepo.php

select * from `producer` where `producer`.`id` in (24)
select * from `products` where `id` = 'nintendo-switch-oled-model-splatoon-3-edition' or `slug` = 'nintendo-switch-oled-model-splatoon-3-edition' limit 1
select `blogs`.*, `prd_rela_blog`.`products_id` as `pivot_products_id`, `prd_rela_blog`.`blogs_id` as `pivot_blogs_id` from `blogs` inner join `prd_rela_blog` on `blogs`.`id` = `prd_rela_blog`.`blogs_id` where `prd_rela_blog`.`products_id` in (116)
---
    public function product($id)
    {
        return Products::with(['gll', 'policies', 'user', 'categories', 'ins', 'cat_game', 'blocks', 'bundled_products', 'related_blogs', 'producer', 'type'])->where('id', $id)->orWhere('slug', $id)->firstOrFail();