app/Repositories/DaviUser.php

select * from `users` where `id` = 1 limit 1
---
    public function getAvatarUser($id)
    {
        $user = User::where('id', '=', $id)->firstOrFail();

select * from `users` where `id` = 1 limit 1
select * from `roles` where `id` = 1 limit 1
---
    public function getRoleUser($id)
    {
        $user = User::where('id', '=', $id)->first();
        if ($user) {
            return Role::where('id', '=', $user->role_id)->first()->name;

select * from `auth_api_admin` where `users_id` = 1 limit 1
---
    public function ApiExists()
    {
        $api_exists = ApiAdmin::where('users_id', Auth::id())->first();