app/Repositories/DavjCart.php

    public function add__or_update($id = 0, $qty = 1, $op_actives = "", $options = [])
    {
        $product = Products::select(['slug', 'id', 'main_img', 'model', 'name', 'price'])->where('id', $id)->firstOrFail();
        $op_actives = explode(',', $op_actives);
        $price = (int) $product->price;
        $price_op = 0;
        $sub_total = 0;
        $res['act'] = "";
        $res['product'] = "";
        $res['item'] = "";
        if (count($op_actives) > 0) {
            foreach ($op_actives as  $ins_id) {
                $item = Insurance::where('id', $ins_id)->first();
                if ($item) {
                    $price_op += (int) Insurance::where('id', $ins_id)->first()->price;
---
select `slug`, `id`, `main_img`, `model`, `name`, `price` from `products` where `id` = 116 limit 1
select * from `insurance` where `id` = '' limit 1